Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: Perl's process, file, and text manipulation facilities make it particularly well-suited for tasks involving quick prototyping, system utilities, software tools, system management tasks, database access, graphical programming, networking, and world wide web programming.
es_es: Las características de manipulación de texto, archivos y procesos que ofrece Perl lo convierten en un lenguaje especialmente adecuado para tareas que requieren crear rápidamente prototipos, utilidades del sistema, herramientas de software, tareas de administración de sistemas, acceso a bases de datos, programación gráfica, conexión a redes y programación web.

source: $str =~ /^\w/; # Still a match!
es_es: $str =~ /^\w/; # ¡Todavía coincide!

source: See L<perlport> for notes on the portability of this construct.
es_es: Ver L<perlport> para notas sobre la portabilidad de esta construcción.

source: The C<||>, C<//> and C<&&> operators return the last value evaluated (unlike C's C<||> and C<&&>, which return 0 or 1).
es_es: Los operadores C<||>, C<//> y C<&&> devuelven el último valor evaluado (a diferencia de los operadores del C C<||> y C<&&>, que devuelve 0 o 1).

source: Uses the value of EXPR as a filename and executes the contents of the file as a Perl script.
es_es: Usa el valor de EXPR como el nombre de un archivo y ejecuta los contenidos del archivo como un script Perl.

# print "Exists " if exists $array[$index];
source: print "Exists\n" if exists $array[$index];
es_es: print "Existe\n" if exists $array[$indice];

source: When interactions between data are best represented by overloaded operators
es_es: Cuando las interacciones entre los datos están mejor representados por los operadores sobrecargados

source: read-only hashes (user-level interface is Hash::Util)
es_es: hashes de solo lectura (el interfaz de usuario es Hash::Util)

source: In these cases perl will fall back to the old behaviour of using C's argv[0] value for C<$^X>.
es_es: En estos casos perl volverá al anterior comportamiento de usar el valor del C argv[0] para C<$^X>.

source: More complex data types can be constructed using references, which allow you to build lists and hashes within lists and hashes.
es_es: Se pueden crear tipos de datos más complejos mediante referencias, que permiten generar listas y hashes dentro de listas y hashes.

source: If you run into trouble, it's quite likely that someone else has already solved the problem you're facing.
es_es: Si tiene problemas, es muy probable que alguien ya haya resuelto el problema al que se está enfrentando.

source: Lists may be assigned to only when each element of the list is itself legal to assign to:
es_es: Las listas pueden ser asignados a ella sólo cuando cada elemento de la lista en sí es legal para asignar:

source: It is just an ordinary method (subroutine) defined (or inherited) by modules that wish to export names to another module.
es_es: Es sólo un método (subrutina) ordinario definido (o heredado) por módulos que desean exportar nombres a otro módulo.

source: Any number of C<(*PRUNE)> assertions may be used in a pattern.
es_es: Se pueden usar cualquier número de aserciones C<(*PRUNE)> en un patrón.

source: For example, C<"\128"> in the ASCII character set is equivalent to the two characters C<"\n8">, but the warning C<Illegal octal digit '8' ignored> will be thrown.
es_es: Por ejemplo, C<"\128"> en el juego de caracteres ASCII es equivalente a los dos caracteres C<"\n8">, pero se mostrará la advertencia I<Illegal octal digit '8' ignored> (C<Se ignora el carácter octal ilegal '8'>).

source: If "?" is the delimiter, then a match-only-once rule applies, described in C<m?PATTERN?> below.
es_es: Si "?" es el delimitador, entonces se aplica la regla coincide-solo-una-vez, descrito más abajo, en C<?PATRÓN?>.

source: This function behaves the same way under various pragmata, such as in a locale, as L</lc> does.
es_es: Esta función se comporta de la misma manera bajo varios I<pragma>, como por ejemplo en una configuración regional, como lo hace L</lc>.

source: to get dates with leading zeros.
es_es: para obtener fechas con ceros a la izquierda.

source: ($foo = $bar) =~ s/this/that/; # copy first, then change
es_es: ($foo = $bar) =~ s/este/aquel/; # primero copiar, luego cambiar

source: $AoA[$i] = @tmp; # WRONG!
es_es: $AoA[$i] = @tmp; # ¡MAL!

source: The wandering prose riddled with jargon is hard to fathom in several places.
es_es: La prosa errante llena de jerga es difícil de entender, en varios lugares.

source: If you still have concerns or difficulties understanding my intent, feel free to contact me.
es_es: Si aún tiene dudas o dificultades para comprender mi intención, no dude en ponerse en contacto conmigo.

source: # No direct -X operator counterpart, but for the first one
es_es: # No tiene un operador -X parejo, pero para el primero

source: The interpretation of operations and values in Perl sometimes depends on the requirements of the context around the operation or value.
es_es: La interpretación de las operaciones y los valores en Perl depende a veces de las necesidades del contexto en el que se encuentra la operación o el valor.

source: The diagnostic output of Carp has been changed slightly, to add a space after the comma between arguments.
es_es: La salida de diagnóstico de Carp se ha cambiado un poco, para agregar un espacio después de la coma entre los argumentos.

source: Removed F<libbsd> for AIX 5L and 6.1.
es_es: Eliminado F<libbsd> de AIX 5L y 6.1.

source: =item Miscellaneous
es_es: =item Otros operadores

source: by Jan Goyvaerts and Steven Levithan
es_es: Jan Goyvaerts y Steven Levithan

# printf "%2$d %d %d ", 12, 34; # will print "34 12 34 "
source: printf "%2\$d %d %d\n", 12, 34; # will print "34 12 34\n"
es_es: printf "%2\$d %d %d\n", 12, 34; # imprimirá "34 12 34\n"

source: If FUNCTION is a string starting with C<CORE::>, the rest is taken as a name for a Perl builtin.
es_es: Si FUNCIÓN es una cadena que comienza con C<CORE::>, el resto es tomado como un nombre para una orden interna de Perl.

source: ee Evaluate the right side as a string then eval the result.
es_es: ee Evalúa el lado derecho como una cadena que es pasada por eval() para obtener el resultado

source: See L<perlport/localtime> for portability concerns.
es_es: Ver L<perlport/localtime> para las problemas sobre portabilidad.

source: while (<ARTICLE>) {...
es_es: while (<ARTICULO>) {...

source: If a C<(*MARK:NAME)> was encountered while matching, then it is that position which is used as the "skip point".
es_es: Si se ha encontrado un C<(*MARK:NOMBRE)> durante la búsqueda, entonces es la posición que es utilizada como el "punto de salto".

source: "spat"> or C<2.18 ..
es_es: "spat"> oo C<2.18 ..

source: Issuing a "make test" will run all the tests.
es_es: La ejecución de un "make test" ejecutará todas las pruebas.

source: =item print FILEHANDLE
es_es: =item print IDENTIFICADOR_ARCHIVO

source: "Foo.pm provides an implementation of the FOO protocol.
es_es: "Foo.pm proporciona una implementación del protocolo FOO.

source: See L<perlfunc/readline>.
es_es: Vea L<perlfunc/readline>.

source: # matches in 5.8.x, doesn't match in 5.10.0
es_es: # coincide en 5.8.x, no coincide in 5.10.0

source: =head2 Updated modules
es_es: =head2 Módulos actualizados

source: TYPE is currently bound to the use of the C<fields> pragma, and attributes are handled using the C<attributes> pragma, or starting from Perl 5.8.0 also via the C<Attribute::Handlers> module.
es_es: TIPO está vinculado al uso del pragma C<fields>, y los atributos se manejan con el pragma C<attributes>, o a partir de Perl 5.8.0 también a través del módulo C<Attribute::Handlers>.

source: Tautologous boolean operators are still going to be optimized away.
es_es: Los operadores booleanos tautológicos tienen que ser optimizados.

source: See also L<perlipc/"SysV IPC">, C<IPC::SysV>, and the C<IPC::Shareable> module from CPAN.
es_es: Vea también L<perlipc/"SysV IPC">, C<IPC::SysV>, y el módulo C<IPC::Shareable> en CPAN.

source: add perlpacktut
es_es: añadido perlpacktut

source: This zero-width pattern prunes the backtracking tree at the current point when backtracked into on failure.
es_es: Este patrón de ancho cero poda el árbol de vuelta atrás en el punto actual de cuando dio vuelta atrás a causa de un fallo.

source: \b backspace (BS)
es_es: \b retroceso (BS)

source: C<perlivp> implements new option C<-a> and will not check for F<*.ph> files by default any more.
es_es: C<perlivp> implementa la nueva opción C<-a>, y ya no buscará, por defecto, por archivos F<*.ph>.

source: If you're writing your own documentation in POD, the F<podchecker> utility will look for errors in your markup.
es_es: Al redactar documentación POD puede usar la utilidad F<podchecker> para detectar errores de marcas POD.

source: A value of -1 in either position is interpreted by most systems to leave that value unchanged.
es_es: Un valor de -1 en cualquier posición es interpretado en la mayoría de los sistemas como que se deja el actual valor sin cambiar.

source: =item map BLOCK LIST X<map>
es_es: =item map BLOQUE LISTA X<map>

source: But because a quantifier (C<\D*>) has been used in the regular expression, the search engine can backtrack and retry the match differently in the hope of matching the complete regular expression.
es_es: Pero debido a que se ha utilizado un cuantificador (C<\D*>) en la expresión regular, el motor de búsqueda puede dar marcha atrás y volver a intentar la coincidencia de manera diferente con la esperanza de hacer coincidir la expresión regular completa.

source: That's because $x is a simple scalar variable, but C<$hash{key}> is not--it's a hash element.
es_es: Esto se debe a que C<$x> es una variable escalar simple, pero C<$hash{clave}> no lo es: es un elemento de un hash.

source: (But see also L<Bitwise String Operators>.) However, C<use integer> still has meaning for them.
es_es: (Pero vea también L<Operadores de bit en cadenas>). Sin embargo, C<use integer> todavía tiene sentido para ellos.

source: @chars = map(chr, @numbers);
es_es: @caracteres = map(chr, @numeros);

source: =item package NAMESPACE
es_es: =item package ESPACIO_NOMBRES

source: You may sell such an object file as proprietary provided that you provide or offer to provide the Perl source, as specified by the GNU General Public License.
es_es: Usted puede vender como un código objeto como objeto propietario, siempre que usted proporcione u ofrezca una forma de proporcionar el código fuente de Perl, según lo especificado por la GNU General Public License.

source: ISBN 1-884777-79-1 [1st edition August 1999]
es_es: ISBN 1-884777-79-1 [1ª edición - Agosto de 1999]

source: perlfaq2 Obtaining and Learning about Perl
es_es: perlfaq2 Cómo obtener y aprender a utilizar Perl

source: Perl 5.9.2 introduced a change so that assignments of C<undef> to a scalar, or of an empty list to an array or a hash, were optimised out.
es_es: Perl 5.9.2 introducía un cambio para que las asignaciones de C<undef> a un escalar, o de una lista vacía a un array o un hash, fueran optimizadas.

source: Not affected by /s modifier
es_es: No se ve afectado por el modificador /s

source: native integer --> decimal string
es_es: entero nativo --> cadena decimal

source: See L<perlobj>.
es_es: Ver L<perlobj>.

source: Groups are numbered with the leftmost open parenthesis being number 1, etc. If a group did not match, the associated backreference won't match either.
es_es: Los grupos son numerados siendo el paréntesis abierto más a la izquierda el número 1, etc. Si un grupo no se ha encontrado, la contrareferencia asociada no será inicializada.

source: It will also probe for C<futimes> and whether C<sprintf> correctly returns the length of the formatted string, which will both be used in perl 5.8.9.
es_es: También probará por C<futimes> y también por si C<sprintf> devuelve correctamente la longitud de la cadena formateada, que serán ambas usadas en perl 5.8.9.

source: See L</warn>, L<perlvar>, L<warnings> and L<perllexwarn>.
es_es: Ver L</warn>, L<perlvar>, L<warnings> y L<perllexwarn>.

source: The most important thing is to run your programs under the B<-w> flag at all times.
es_es: Lo más importante es ejecutar siempre sus programas con la opción B<-w> puesta.

source: To read old I<TPJ> articles, see http://www.ddj.com/ or brian d foy's index of online TPJ content ( http://www.perlmonks.org/index.pl?node_id=711609 ).
es_es: Para leer artículos antiguos de I<TPJ>, visite http://www.ddj.com/ o consulte el índice de contenido en línea de TPJ proporcionado por brian d foy ( http://www.perlmonks.org/index.pl?node_id=711609 ).

source: (However, if the object overloads the stringification or the numification operators, and if overload fallback is active, it will be used instead, as usual.)
es_es: (Sin embargo, si el objeto sobrecarga la conversión en cadena de caracteres o los operadores de conversión en números, y si la sobrecarga de reserva está activa, será utilizada en su lugar, como de costumbre.)

source: ($Config{doublesize} == $Config{longdblsize}) && print "doubles are long doubles\n";
es_es: ($Config{doublesize} == $Config{longdblsize}) && print "doubles son long doubles\n";

source: Once you've exhausted the documentation, please report bugs to us using the 'perlbug' tool.
es_es: Una vez que haya agotado la documentación, por favor, infórmenos de los errores a través de la herramienta 'perlbug'.

source: print $i++; # prints 0
es_es: print $i++; # imprime 0

source: $obj->do_something("wibble", "text", 1024);
es_es: $obj->hacer_algo("wibble", "texto", 1024);

source: would match the same as C</(Y) ( (X) \g3 \g1 )/x>.
es_es: coincidiría igual que con C</(Y) ( (X) \g3 \g1 )/x>.

source: Described in L<perluniintro>, L<perllocale> and L<Locale::Maketext>.
es_es: Se describe en L<perluniintro>, L<perllocale> y L<Locale::Maketext>.

source: perl583delta - what is new for perl v5.8.3
es_es: perl583delta - Qué hay de nuevo para perl v5.8.3

source: If you have to do anything with the number of bytes, it's probably best to move that part to step 3, just after you've encoded the string.
es_es: Si necesita el número de bytes para algo, debe calcularlo en el paso 3, después de codificar la cadena.

source: Core Perl modules
es_es: Módulos pertenecientes al núcleo de Perl

source: On a Bourne-like shell, this can be done as
es_es: En un shell de la familia Bourne, esto se puede hacer así

source: If a precision obtained through C<*> is negative, it counts as having no precision at all.
es_es: Si una precisión obtenida a través de C<*> es negativa, se cuenta como no tener precisión en absoluto.

source: For C<last>, you have to be more elaborate: X<last>
es_es: Para C<last>, ha de ser un poco más elegante X<last>

source: =item Input and output functions X<I/O> X<input> X<output> X<dbm>
es_es: =item Funciones de Entrada y Salida X<I/O> X<input> X<output> X<dbm> X<entrada> X<salida>

source: $filename =~ s/(.*\.gz)\s*$/gzip -dc < $1|/;
es_es: $archivo =~ s/(.*\.gz)\s*$/gzip -dc < $1|/;

source: A filehandle, from which the file will be read.
es_es: Un identificador de archivo, desde el cual, el archivo será leído.

source: is the same as C</u>, except that C<\d>, C<\s>, C<\w>, and the Posix character classes are restricted to matching in the ASCII range only.
es_es: es lo mismo que C</u>, excepto que C<\d>, C<\s>, C<\w>, y las clases carácter de Posix se limitan a coincidir solo dentro del rango del ASCII.

source: (If EXPR happens to start off with C<0x>, interprets it as a hex string.
es_es: (Si EXPR comienza con C<0x>, se interpreta como una cadena en hexadecimal.

source: THAT
es_es: ESE

source: To capture a command's STDOUT but discard its STDERR:
es_es: Para capturar el STDOUT de un comando pero descartar su STDERR:

source: Did we mention that you should definitely consider using the B<-w> switch?
es_es: No olvide que es muy importante utilizar el modificador B<-w>.

source: At any given time, exactly one of these modifiers is in effect.
es_es: En un momento determinado, solo uno de estos modificadores está en vigor.

source: =head1 FILES
es_es: =head1 ARCHIVOS

source: the pattern uses a Unicode name (C<\N{...}>); or
es_es: el patrón utiliza un nombre Unicode (C<\N{...}>); o

source: This is not for the faint of heart, as they have to plug in at the C level.
es_es: Esto no es para los débiles de corazón, ya que tienen que conectar a nivel de C.

source: ISBN 978-1-56592-699-8 [February 2000]
es_es: ISBN 978-1-56592-699-8 [Febrero de 2000]

# print "match: <$&> " while 'foo' =~ m{ o?
source: print "match: <$&>\n" while 'foo' =~ m{ o?
es_es: print "coincidencia: <$&>\n" while 'foo' =~ m{ o?

source: If the absolute value of the right operand (C<abs($b)>) is greater than or equal to C<(UV_MAX + 1)>, "%" computes the floating-point remainder C<$r> in the equation C<($r = $a - $i*$b)> where C<$i> is a certain integer that makes C<$r> have the same sign as the right operand C<$b> (B<not> as the left operand C<$a> like C function C<fmod()>) and the absolute value less than that of C<$b>.
es_es: Si el valor absoluto del operando derecho (C<abs($b)>) es mayor o igual a C<(UV_MAX + 1)>, "%" computa el resto en punto flotante C<$r> en la ecuación C<($r = $a - $i*$b)> donde C<$i> es un cierto entero que hace que C<$r> tenga el mismo signo que el operando de la derecha C<$b> (B<no> como el operando izquierdo C<$a> como la función C C<fmod()>) y el valor absoluto menor que el de C<$b>.

source: B<RESTRICTION>: The conversions marked with C<(*)> above involve steps performed by the C compiler.
es_es: B<RESTRICCIÓN>: las conversiones anteriores marcadas con C<(*)> implican pasos ejecutados por el compilador de C.

source: This exponential performance will make it appear that your program has hung.
es_es: Este rendimiento exponencial le hará creer que su programa se ha bloqueado.

source: F<prove> is a command-line interface to the test-running functionality of F<Test::Harness>.
es_es: F<prove> es una interfaz de línea de comandos de la funcionalidad de ejecución de pruebas de F<Test::Harness>.

source: The special arrays C<@-> and C<@+> are no longer interpolated in regular expressions.
es_es: Los arrays especiales C<@-> y C<@+> ya no son interpolados en las expresiones regulares.

source: $string =~ $re; # or used standalone
es_es: $cadena =~ $re; # o usar de forma aislada

source: This introductory document does not aim to be complete.
es_es: Es un documento introductorio, no una guía completa.

source: # same thing, but without any temps
es_es: # lo mismo, pero sin usar ninguna variable temporal

source: These are disallowed under C</l>.
es_es: Éstos no se permiten bajo C</l>.

source: Many operators can be combined with a C<=> as follows:
es_es: Muchos operadores se pueden combinar con un signo C<=> de la manera siguiente:

source: In general, conversion from one form to another is transparent.
es_es: En general, la conversión entre uno y otro tipo es transparente.

source: In place of a SUBNAME, you can provide a BLOCK as an anonymous, in-line sort subroutine.
es_es: En lugar de un NOMBRE_SUB, puede proporcionar un BLOQUE como si fuera una subrutina de ordenación anónima.

source: Such a list may consist of any combination of scalar arguments or list values; the list values will be included in the list as if each individual element were interpolated at that point in the list, forming a longer single-dimensional list value.
es_es: Tal lista puede consistir en cualquier combinación de argumentos escalares o valores de lista; los valores de lista serán incluidos en la lista como si cada elemento individual fuera interpolado en ese punto en la lista, formando un largo y unidimensional valor de lista.

source: PATTERN may contain variables, which will be interpolated every time the pattern search is evaluated, except for when the delimiter is a single quote.
es_es: PATRÓN puede contener variables, que serán interpoladas cada vez que el patrón de búsqueda sea evaluado, a excepción de cuando el delimitador sea una comilla simple.

source: `` qx{} Command yes*
es_es: `` qx{} Comando sí*

source: In these loop constructs, the assigned value (whether assignment is automatic or explicit) is then tested to see whether it is defined.
es_es: En estas construcciones de bucle, el valor asignado (tanto si la asignación es automática o explícita) es examinado para ver si está definido.

source: if ( /foo(.*)bar/ ) {
es_es: if ( /mesa(.*)come/ ) {

source: Note: C<unlink> will not attempt to delete directories unless you are superuser and the B<-U> flag is supplied to Perl.
es_es: Nota: C<unlink> no intentará eliminar directorios a menos que usted sea superusuario y la bandera B<-U> se suministre a Perl.

source: This is the internal function implementing the C<< <EXPR> >> operator, but you can use it directly.
es_es: Esto es la función interna que implementa el operador C<< <EXPR> >>, pero puede usarla directamente.

source: =head2 Plain Old Comments (Not!) X<comment> X<line> X<#> X<preprocessor> X<eval>
es_es: =head2 Antiguos comentarios (¡Pero no tanto!) X<comment> X<line> X<#> X<preprocessor> X<eval> X<comentario> X<línea>

source: =item Regular expressions and pattern matching X<regular expression> X<regex> X<regexp>
es_es: =item Expresiones regulares y coincidencia de patroner X<regular expression> X<regex> X<regexp> X<expresión regular>

source: After all child processes are gone BeOS' waitpid(-1,...) returns 0 instead of -1 (as it should).
es_es: Después de que todos los procesos hijo hayan terminado, el waitpid(-1, ...) de BeOS devuelve 0 en lugar de -1 (como debería).

source: # (including lexicals) in $_ : First $1 is interpolated
es_es: # (incluyendo léxicas) en $_ : Primero $1 es interpolado

source: Use of nanosleep(), if available, allows mixing subsecond sleeps with alarms.
es_es: El uso de nanosleep(), si está disponible, permite la mezcla de lapsos en fracciones de segundo junto con las alarmas.

source: ($one,$five,$fifteen) = (`uptime` =~ /(\d+\.\d+)/g);
es_es: ($uno,$cinco,$quince) = (`uptime` =~ /(\d+\.\d+)/g);

# print "Exists " if exists $hash{$key};
source: print "Exists\n" if exists $hash{$key};
es_es: print "Existe\n" if exists $hash{$clave};

source: See L<overload> for details.
es_es: Encontrará información detallada en L<overload>.

source: delete $ref->[$x][$y][$index];
es_es: delete $ref->[$x][$y][$indice];

source: Cases 1 and 2 above behave identically: they run the code contained in the variable $x.
es_es: Los casos 1 y 2 se comportan idénticamente: ejecutan el código contenido en la variable $x.

source: Improved documentation.
es_es: Documentación mejorada.

source: print(" UPPERCASE"), redo LOOP if /\G\p{Lu}+\b[,.;]?\s*/gc;
es_es: print(" MAYÚSCULA"), redo LOOP if /\G\p{Lu}+\b[,.;]?\s*/gc;

source: } 0..$#old
es_es: } 0..$#viejo

source: Larry and the Perl development team occasionally make changes to the internal core of the language, but all possible efforts are made toward backward compatibility.
es_es: Ocasionalmente, Larry y el equipo de desarrollo de Perl realizan cambios en los componentes internos del lenguaje, pero siempre se hace lo posible por mantener la compatibilidad con las versiones anteriores.

source: Another other case is where you need a cryptographically-strong starting point rather than the generally acceptable default, which is based on time of day, process ID, and memory allocation, or the F</dev/urandom> device if available.
es_es: Otro caso es donde necesitará un punto de partida criptográficamente más fuerte que el valor predeterminado generalmente aceptado, que se basa en la hora del día, ID del proceso, y la asignación de memoria, o el dispositivo F</dev/urandom>, si está disponible.
